https://www.youtube.com/watch?v=PtO3t6ynH-8&t=314s

#### How do I use the "axis" parameter in Pandas?

### Droping Columns & Rows

Droping Columns:


      1. drinks.drop('continent', axis=1).head()
      
      2. drinks.drop('wine_servings', axis=1, inplace=True)
      
      3. drinks.drop(columns=['beer_servings'],axis=1,inplace=True)
      
      
Droping Rows:


      1. drinks.drop(2, axis=0).head()

In [12]:
import pandas as pd
import numpy as np

In [2]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry", sep=",")
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

#### axis=1/0 ---> Temaprory action;    axis=1/0; inplace=True  --->  Permanant action

### axis=1 --->  Droping Column

### axis=0 --->  Droping Row

In [3]:
drinks.drop('continent', axis=1).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [4]:
drinks.drop(2, axis=0).head()        # Droped Row : 2
                                     # In Previous cell droped "continent" but still generated because not used inplace=True

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America

-------------------------------------------------------------------------------------------------------------------------------

# Que: How to remove rows [4:9] instead of just removing row 2 ?
    
# I want to count the number of duplicates in a particular column in a data-frame

     df.column_name.duplicated().sum()

In [6]:
drinks.drop(columns=['beer_servings'],axis=1,inplace=True)

In [14]:
drinks.drop('wine_servings',axis=1,inplace=True)

In [15]:
drinks.head()

       country  spirit_servings  total_litres_of_pure_alcohol
0  Afghanistan                0                           0.0
1      Albania              132                           4.9
2      Algeria                0                           0.7
3      Andorra              138                          12.4
4       Angola               57                           5.9

In [8]:
drinks.drop(2, axis=0).head()

,country,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0.0
1,Albania,132,54,4.9
3,Andorra,138,312,12.4
4,Angola,57,45,5.9
5,Antigua & Barbuda,128,45,4.9

In [9]:
drinks.drop(3, axis=0).head()

,country,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0.0
1,Albania,132,54,4.9
2,Algeria,0,14,0.7
4,Angola,57,45,5.9
5,Antigua & Barbuda,128,45,4.9

In [13]:
drinks.drop(iloc[4:9], axis=0).head()

NameError: name 'iloc' is not defined